Documents/CRM_ЗаписьНаВыдачу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>CRM_ЗаписьНаВыдачу</Name>
			<BasedOn>
				<xr:Item>Document.CRM_КоммерческоеПредложение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Renault_АвтомобилиКВыдаче</xr:Item>
				<xr:Item>InformationRegister.CRM_АвтомобилиВыданные</xr:Item>
				<xr:Item>InformationRegister.CRM_ЗаписиНаВыдачу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыДокументаЗаписьНаВыдачу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаВыдачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ЗоныВыдачиАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаАвтомобили</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорНаПродажуАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаОбработкуПерсональныхДанных</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_СогласиеНаОбработкуПерсональныхДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АвтомобилиДляВыдачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Renault_АвтомобилиКВыдаче.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Renault_АвтомобилиКВыдаче</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/CRM_АвтомобилиВыданные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_АвтомобилиВыданные</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_ЗаписиНаВыдачу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ЗаписиНаВыдачу</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_ЗаписьНаВыдачу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_РабочиеЛисты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_РабочиеЛисты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>VINАвтомобилей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаID</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапросНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛистЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаркаАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МодельАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтересМодель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныЗакрытияРЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_НаборЦветов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖелаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапросаНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРабочегоЛиста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыРабочихЛистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязаныйIDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродажаБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтомобильБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПродажиВыкупа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокГарантии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАвтомобиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDCRM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/CRM_ЗаписьНаВыдачу/Ext/ObjectModule.bsl
// Общий журнал

Перем Права Экспорт;

Перем Организация Экспорт;

Перем СоздатьЗаявкуНаУтверждение;

Функция ПолучитьСписокПечатныхФорм(ДокументСсылка = Неопределено) Экспорт
	Возврат Новый СписокЗначений();	
КонецФункции
//Конец необходимых для общих журналов

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Автомобили к выдаче
	Движения.Renault_АвтомобилиКВыдаче.Записывать = Истина;
	Движения.Renault_АвтомобилиКВыдаче.Очистить();
	
	Движения.CRM_АвтомобилиВыданные.Записывать = Истина;
	Движения.CRM_АвтомобилиВыданные.Очистить();

	
	Renault_CRM.Воронка_ВыдачаАвто_Снять(IDK, Ссылка);
	Renault_CRM.Статистика_Снять(Справочники.CRM_ЭтапыПродаж.ВыдачаАвтомобиля, IDK, Ссылка);
	
	// регистр Renault_АвтомобилиКВыдаче Расход
		
	Если Статус = Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Выдан
			ИЛИ Статус = Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Черновик Тогда
			
			Для Каждого Строка Из АвтомобилиДляВыдачи Цикл
				
				Если Строка.Выбран И ЗначениеЗаполнено(Строка.VIN) Тогда
					Движение = Движения.Renault_АвтомобилиКВыдаче.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.РабочийЛист = IDK;
					Движение.Автомобиль = Строка.Автомобиль;
					Движение.VIN = Строка.VIN;
					Движение.Количество = 1;
				КонецЕсли;
			КонецЦикла;
		
	КонецЕсли;
		
	Если Статус = Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Выдан Тогда
		
		//Воронка
		Если АвтомобилиДляВыдачи.Количество() > 0 Тогда
			Renault_CRM.Воронка_ВыдачаАвто_Установить(IDK, Ссылка, ДатаВыдачи);
			Renault_CRM.Статистика_Установить(Справочники.CRM_ЭтапыПродаж.ВыдачаАвтомобиля, IDK, Ссылка, , ДатаВыдачи, АвтомобилиДляВыдачи[0].Автомобиль.Модель);
		КонецЕсли;
		
		//Автомобили выданные
		Для Каждого Строка Из АвтомобилиДляВыдачи Цикл
			Если Строка.Выбран И ЗначениеЗаполнено(Строка.VIN) Тогда
				НовЗапись = Движения.CRM_АвтомобилиВыданные.Добавить();
				НовЗапись.VIN = Строка.VIN;
				НовЗапись.ДатаВыдачи = ДатаВыдачи;
				НовЗапись.Регистратор = Ссылка;
				НовЗапись.Период =ДатаВыдачи;
				ДЦ = Неопределено;
				
				Если ЗначениеЗаполнено(IDK) Тогда
					Запись = Renault_CRM.докПолучитьЗаписьРЛПоIDK(IDK);
					Если Запись <> Неопределено Тогда 
						ДЦ = Запись.ДилерскийЦентр;
						Если ДЦ.СинхронизированСПланшетомПродавца = Истина Тогда
							АвтомобильИД = Строка(Строка.Автомобиль.Ссылка.УникальныйИдентификатор());
							мПараметры = Новый Массив;
							мПараметры.Добавить(АвтомобильИД);
							//ФоновыеЗадания.Выполнить("Renault_РаботаСSalesTablet.УдалитьАвтоИзСклада", мПараметры);
							//Renault_РаботаСSalesTablet.УдалитьАвтоИзСклада(АвтомобильИД);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		
		
	ИначеЕсли Статус = Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Черновик Тогда
		
		////Черновики - в записи на выдачу
		//Запись = РегистрыСведений.CRM_ЗаписиНаВыдачу.СоздатьМенеджерЗаписи();
		//Запись.Клиент = Клиент;
		//Запись.Документ = Ссылка;
		//Запись.Менеджер = Менеджер;
		//Запись.Записать();
	Иначе
		//
	КонецЕсли;
	
	////сервис статистики передачи авто
	Если Не Отказ И LADA_Services.ВыгрузкаВыдачиАвтомобиля(ЭтотОбъект.Ссылка,Отказ) Тогда Иначе 
		//последствия ...
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Renault_CRM.Воронка_ВыдачаАвто_Снять(IDK, Ссылка);	
	УдалитьЗаписиНаВыдачу();
	
	//сервис статистики передачи авто
	Если Не Отказ И LADA_Services.ВыгрузкаВыдачиАвтомобиля(ЭтотОбъект.Ссылка,Отказ) Тогда Иначе 
		//последствия ...
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьЗаписиНаВыдачу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_ЗаписиНаВыдачу.Регистратор,
	               |	CRM_ЗаписиНаВыдачу.НомерСтроки,
	               |	CRM_ЗаписиНаВыдачу.Активность,
	               |	CRM_ЗаписиНаВыдачу.Автомобиль,
	               |	CRM_ЗаписиНаВыдачу.Менеджер,
	               |	CRM_ЗаписиНаВыдачу.ДатаНачала,
	               |	CRM_ЗаписиНаВыдачу.Клиент,
	               |	CRM_ЗаписиНаВыдачу.Документ
	               |ИЗ
	               |	РегистрСведений.CRM_ЗаписиНаВыдачу КАК CRM_ЗаписиНаВыдачу
	               |ГДЕ
	               |	CRM_ЗаписиНаВыдачу.Документ = &Документ";
	Запрос.УстановитьПараметр("Документ", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.CRM_ЗаписиНаВыдачу.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.Удалить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьЗвонкиВежливостиАвтоматически()
	
	ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	События = ДЦ.ЗвонкиВежливости;
	
	// Беседин 19.10.21 заявка 1082 коммент
	//Строка1 = События.Найти("Звонок №1", "ЗвонокНомер");
	//Если Строка1.ДелатьЗвонок Тогда
	//	СоздатьЗвонокВежливости(Строка1);
	//КонецЕсли;
	//
	//Строка2 = События.Найти("Звонок №2", "ЗвонокНомер");
	//Если Строка2.ДелатьЗвонок Тогда
	//	СоздатьЗвонокВежливости(Строка2);
	//КонецЕсли;
	//
	//Строка3 = События.Найти("Звонок №3", "ЗвонокНомер");
	//Если Строка3.ДелатьЗвонок Тогда
	//	СоздатьЗвонокВежливости(Строка3);
	//КонецЕсли;                           
	
	// Беседин 19.10.21 заявка 1082
	Для Каждого ОдноСобытие Из События Цикл
		Если ОдноСобытие.ДелатьЗвонок Тогда
			СоздатьЗвонокВежливости(ОдноСобытие); 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьЗвонокВежливости(Событие)
	
	СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
	СобытиеОбъект.Дата = ТекущаяДата();
	СобытиеОбъект.Автор = ПараметрыСеанса.Пользователь.Сотрудник;
	СобытиеОбъект.ДатаНапоминания = СобытиеОбъект.Дата  + Событие.КоличествоДней*60*60*24;
	СобытиеОбъект.IDK = IDK;
	СобытиеОбъект.ДилерскийЦентр = ДилерскийЦентр;	
	Если СокрЛП(Событие.ЗвонокНомер) = "Звонок №1" Тогда
		СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливости3;    
		СобытиеОбъект.Комментарий = "Звонок вежливости "+Событие.КоличествоДней+" д.";
	ИначеЕсли СокрЛП(Событие.ЗвонокНомер) = "Звонок №2" Тогда
		СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливости30;    
		СобытиеОбъект.Комментарий = "Звонок вежливости "+Событие.КоличествоДней+" д.";
	ИначеЕсли СокрЛП(Событие.ЗвонокНомер) = "Звонок №3" Тогда
		СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливости360;  
		СобытиеОбъект.Комментарий = "Звонок вежливости "+Событие.КоличествоДней+" д.";
	ИначеЕсли НЕ СокрЛП(Событие.ЗвонокНомер) = "Звонок ДР" Тогда  // Беседин 19.10.21 заявка 1082
		СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.ЗвонокВежливостиНовый;  
		СобытиеОбъект.Комментарий = "Звонок вежливости " + СокрЛП(Событие.ЗвонокНомер) + " " + Событие.КоличествоДней+" д.";
	КонецЕсли;
	СобытиеОбъект.Сотрудник = Менеджер;
	СобытиеОбъект.Обработано = Ложь;
	СобытиеОбъект.ЗавершеноУспешно = Ложь;	
	//СобытиеОбъект.Отдел = Отдел;
	//СобытиеОбъект.Подразделение = Подразделение;	
	Попытка
		СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	//Если СогласиеНаОбработкуПерсональныхДанных.Пустая() Тогда 
	//	Сообщить("Согласие на обработку персональных данных является обязательным",СтатусСообщения.Внимание);
	//	Отказ=Истина;
	//КонецЕсли;
	
	Если АвтомобилиДляВыдачи.Количество() 
			И АвтомобилиДляВыдачи.НайтиСтроки(Новый Структура("Автомобиль", Справочники.Автомобили.ПустаяСсылка())).Количество() Тогда
		Сообщить("В документе не может быть строк без выбранного автомобиля", СтатусСообщения.Внимание);
		Отказ = Истина;
	КонецЕсли;
	
	СоздатьЗаявкуНаУтверждение = Ложь;
	Если ПараметрыСеанса.DMS_Бренд = Справочники.CRM_МаркаАвтомобиля.LADA Тогда
		Если Не РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			Если ДатаНачала<НачалоМесяца(ТекущаяДата())
				И ДатаВыдачи<>Ссылка.ДатаВыдачи
				И Статус = Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Выдан Тогда   
				Если ЭтоНовый() Тогда
					СоздатьЗаявкуНаУтверждение = Истина;
					Утверждена = Ложь;
				Иначе
					Утверждена = ЗаявкаУтверждена(Ссылка);
					Если Утверждена = Неопределено Тогда
						СоздатьЗаявкуНаУтверждение = Истина;
						Утверждена = Ложь;
					КонецЕсли;
				КонецЕсли;
				Если Не Утверждена Тогда 
					РежимЗаписи = РежимЗаписиДокумента.Запись;					
					Статус = Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Черновик;
					Если Не СоздатьЗаявкуНаУтверждение Тогда
						Сообщить("Выдача автомобиля VIN " + VIN + " прошлым периодом не утверждена.");
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
	СтрокаАвтомобили = "";
	НужнаЗапятая = Ложь;
	Для Каждого Стр Из АвтомобилиДляВыдачи Цикл
		Если НужнаЗапятая Тогда
			СтрокаАвтомобили = СтрокаАвтомобили + ", ";
		Иначе
			НужнаЗапятая = Истина;
		КонецЕсли;
		СтрокаАвтомобили = СтрокаАвтомобили + Стр.VIN;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Ссылка)
		И Ссылка.Статус <> Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Выдан 
		И Статус = Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Выдан Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_ЗаписьНаВыдачу.Ссылка
		|ИЗ
		|	Документ.CRM_ЗаписьНаВыдачу КАК CRM_ЗаписьНаВыдачу
		|ГДЕ
		|	CRM_ЗаписьНаВыдачу.Статус <> &Статус
		|	И CRM_ЗаписьНаВыдачу.Ссылка <> &Ссылка
		|	И CRM_ЗаписьНаВыдачу.IDK = &IDK";
		
		Запрос.УстановитьПараметр("IDK", IDK);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Статус", Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Выдан);
		
		Если Запрос.Выполнить().Пустой() Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ *
			|ИЗ
			|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
			|ГДЕ
			|	Renault_РабочиеЛисты.IDK = &IDK");
			Запрос.УстановитьПараметр("IDK", IDK);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				МенеджерРЛ = РегистрыСведений.Renault_РабочиеЛисты.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МенеджерРЛ, Выборка);
				МенеджерРЛ.Прочитать();
				МенеджерРЛ.ЛистЗакрыт = ?(ДилерскийЦентр.ЗакрыватьРЛПриВыдаче, Ложь, Истина);
				МенеджерРЛ.ПричинаЗакрытия = Справочники.CRM_ПричиныЗакрытияРЛ.УспешнаяПродажа;
				МенеджерРЛ.ЗапросНаЗакрытие = Истина;
				МенеджерРЛ.ДатаЗапросаНаЗакрытие = ТекущаяДата();
				МенеджерРЛ.КомментарийЗакрытия = "";
				МенеджерРЛ.Записать();
			КонецЕсли;
		КонецЕСли;
	КонецЕсли;	
	
	//проверка факта выдачи
	Если Статус=Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Выдан И Статус<>Ссылка.Статус Тогда
		ДополнительныеСвойства.Вставить("ПроизошлаВыдача",Истина)
	ИначеЕсли Не Ссылка.Пустая() И Статус<>Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Выдан И Статус<>Ссылка.Статус Тогда
		ДополнительныеСвойства.Вставить("ПроизошлаВыдача",Ложь)	
	Иначе	
		ДополнительныеСвойства.Вставить("ПроизошлаВыдача",Неопределено)
	КонецЕсли;	

КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	Если СоздатьЗаявкуНаУтверждение Тогда
		Запись = РегистрыСведений.VAZ_УтверждениеДокументов.СоздатьМенеджерЗаписи();
		Запись.Объект = Ссылка;
		Запись.Записать();
		Сообщить("Создана заявка для утверждения выдачи автомобиля VIN " + VIN + " прошлым периодом.");
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаявкаУтверждена(Ссылка)
	Запрос = Новый Запрос("ВЫБРАТЬ Утвержден, ДатаУтверждения ИЗ РегистрСведений.VAZ_УтверждениеДокументов ГДЕ Объект=&Объект");
	Запрос.УстановитьПараметр("Объект",Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Утвержден = Выборка.Утвержден;
	КонецЦикла;	
	Возврат Утвержден;  
КонецФункции
